Revit 2027 API
DesignToFabricationConverter.GetDesignElementAndFabricationPartsWithOpenConnectors Method
 Gets the collection of design elements that failed to convert and the associated set of fabrication parts with open connectors.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<ElementId, ISet<ElementId>> GetDesignElementAndFabricationPartsWithOpenConnectors()
Public Function GetDesignElementAndFabricationPartsWithOpenConnectors As IDictionary(Of ElementId, ISet(Of ElementId))
public:
IDictionary<ElementId^, ISet<ElementId^>^>^ GetDesignElementAndFabricationPartsWithOpenConnectors()
member GetDesignElementAndFabricationPartsWithOpenConnectors : unit -> IDictionary<ElementId, ISet<ElementId>>
Return Value
IDictionary<ElementId, ISet<ElementId>>
 A map of design element identifiers that were not converted and the associated set fabrication parts left with open connectors.
Remarks
 This set of element identifiers is only available after the Convert method has been invoked, and returns DesignToFabricationConverterResult::Enum::PartialFailure.
See Also
Reference
DesignToFabricationConverter Class
Autodesk.Revit.DB.Fabrication Namespace